In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [17]:
df = pd.read_csv("dataset/test.csv")
df.head(4)

     A      B      C     D
0    1      2      5     8
1   98     65    444  8947
2  874     51     64  6874
3    8  68468  86146    84

In [13]:
df = pd.read_csv("dataset/test.csv", header=None, names=["a","b","c","d"])
df.head(4)

     a   b    c     d
0    A   B    C     D
1    1   2    5     8
2   98  65  444  8947
3  874  51   64  6874

In [18]:
df = pd.read_csv("dataset/test.csv",nrows=3)
df

     A   B    C     D
0    1   2    5     8
1   98  65  444  8947
2  874  51   64  6874

### Zip

In [38]:
a = [1,2,3,4]
b = [6,7,8,9]
l = [[1,2,3,4],[5,6,7,8]]

z1 = list( zip(a,b) )
print(z1)

# Self Zipping
z2 = list( zip(a) )
print(z2)

#list zipping
z3 = list(zip(l))
print(z3)

z3 = list( zip(*l) )
print(z3)

[(1, 6), (2, 7), (3, 8), (4, 9)]
[(1,), (2,), (3,), (4,)]
[([1, 2, 3, 4],), ([5, 6, 7, 8],)]
[(1, 5), (2, 6), (3, 7), (4, 8)]

In [39]:
for i in range(1,10):
    print(i)

1
2
3
4
5
6
7
8
9